print("\n", "Первая задача:")
a = [23, 67, 234, 86, 234, 134, 7654, 1223, 12, 1, 4, 46, 3]
print("Минимальный элемент списка -", min(a))
if a.pop(a.index(min(a))):
    print("Новый минимальный элемент списка -", min(a))
print("\n", "Первая задача с повторяющимися наименьшими числами:")
a = [23, 67, 234, 86, 234, 134, 7654, 1223, 12, 1, 4, 46, 3, 1]
print("Минимальный элемент списка -", min(a))
if a.pop(a.index(min(a))):
    print("Новый минимальный элемент списка -", min(a))
print("_" * 100)

print("\n", "Вторая задача:")
sp = [23, 67, 234, 86, 234, 134, 7654, 1223, 12, 1, 5, 46, 3]
x = int(input("Введите начало интервала: "))
y = int(input("Введите конец интервала: "))
r = 0
for i in range(x, y+1):
    if i in sp:
        sp.remove(i)
        sp.append(r)

print(sp)
